
@_date: 2008-02-20 23:22:39
@_author: Nikola =?UTF-8?B?TGXEjWnEhw==?= 
@_subject: Orphaned secret subkeys 
Hash: RIPEMD160
On Thu, 31 Jan 2008 02:37:10 +0100
Hi again,
It seems that not so many mails remain unanswered on this list... So
please let me know if I should report my question with more details or
clarify something.

@_date: 2008-02-22 04:37:19
@_author: Nikola =?UTF-8?B?TGXEjWnEhw==?= 
@_subject: Orphaned secret subkeys 
-----BEGIN PGP SIGNED MESSAGE-----
Hash: RIPEMD160
On Thu, 21 Feb 2008 15:11:57 +0100
Sebastien, thank you for the reply.
That's exactly why I asked: I can't do this. :-) It seems that GnuPG
always wants me to return to the public ring:
%gpg --edit-key 7B063EAA
Secret key is available.
Command> toggle  sec  2048R/7B063EAA  created: 2008-01-30  expires: never     ssb  1024R/35E8152C  created: 2008-01-30  expires: never
ssb  2048R/AE444AB1  created: 2008-01-30  expires: never
ssb  1024g/FA352C19  created: 2008-01-30  expires: never    <--- orphan
ssb  1024R/44EDC121  created: 2008-01-30  expires: never    <--- orphan
ssb  2048R/C0AD5BE4  created: 2008-01-30  expires: never
Command> key 4
ssb* 1024R/44EDC121  created: 2008-01-30  expires: never
Command> delkey
Please use the command "toggle" first.
Command> I understood that delete{,-secret}-keys can't delete subkeys.

@_date: 2008-01-31 02:37:10
@_author: Nikola =?UTF-8?B?TGXEjWnEhw==?= 
@_subject: Orphaned secret subkeys 
============================== START ==============================
[GnuPG-2.0.4 on FreeBSD]
I wasn't aware that one had to 'save' a key immediately after deleting
a subkey (using delkey) in order to replace that subkey with a new one
(using addkey). Now I have this situation:
%gpg --edit-key 7B063EAA
Secret key is available.
gpg: using PGP trust model
pub  2048R/7B063EAA  created: 2008-01-30  expires: never       usage:
SCA trust: ultimate      validity: ultimate
sub  1024R/35E8152C  created: 2008-01-30  expires: 2018-01-28  usage:
S sub  2048R/AE444AB1  created: 2008-01-30  expires: 2018-01-28  usage:
A sub  2048R/C0AD5BE4  created: 2008-01-31  expires: never       usage:
E [ultimate] (1). ..........]
Command> toggle
sec  2048R/7B063EAA  created: 2008-01-30  expires: never     ssb  1024R/35E8152C  created: 2008-01-30  expires: never
ssb  2048R/AE444AB1  created: 2008-01-30  expires: never
ssb  1024g/FA352C19  created: 2008-01-30  expires: never    <------
ssb  1024R/44EDC121  created: 2008-01-30  expires: never    <------
sub  2048R/C0AD5BE4  created: 2008-01-30  expires: never
i.e. I have two orphaned secret subkeys. How can I delete them? And does
their presence matter at all (because, although regenerable AFAIK, their
public parts will never be exported to public keyserver)? Is this
behaviour intentional?
