
@_date: 2002-10-14 23:24:02
@_author: vedaal@compute0.lok.com 
@_subject: deletion of photo id 
is there a way to delete a photo id completely from a key? [ gnupg 1.2.0 ]
{can the deluid command  be used to refer to the photo id as a user id and remove it ?}

@_date: 2002-10-15 17:29:01
@_author: vedaal@compute0.lok.com 
@_subject: deletion of photo id 
what is the proper syntax for the delphoto command ?
{couldn't find it in the man.page under  --edit-key }
tried all the following variations and got the same error message:
This key may be revoked by DSA key 7B534E2D boo pub  1024D/46D7F7C7  created: 2002-06-30 expires: never      trust: u/u
sub  1024g/DF22F970  created: 2002-06-30 expires: never
(1). gpgshell (2)  [jpeg image of size 4095]
Command> delphoto
You must select at least one user ID.
Command> delphoto gpgshell
You must select at least one user ID.
Command> delphoto [jpeg image of size 4095]
You must select at least one user ID.
Command> delphoto DF22F970
You must select at least one user ID.
Command> delphoto 46DF7F7C7
You must select at least one user ID.
